tyh21/ESP32-S3-RLCD-4.2/solar_os/src/services/solar_os_expansion.c
#include "solar_os_expansion.h"

#include <string.h>

#include "esp_check.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "solar_os_board.h"
#include "solar_os_buses.h"
#include "solar_os_config.h"
#include "solar_os_memory.h"
#include "solar_os_pins.h"
#include "solar_os_resources.h"
#include "solar_os_stream.h"
#include "soc/soc_caps.h"

static const solar_os_expansion_driver_t manual_expansion_driver = {
    .name = "manual",
    .summary = "custom resource map",
    .category = SOLAR_OS_EXPANSION_CATEGORY_UTILITY,
    .allow_unlisted_bindings = true,
};

#define SOLAR_OS_DECLARE_EXPANSION_DRIVER(symbol) \
    extern const solar_os_expansion_driver_t symbol;
SOLAR_OS_EXPANSION_DRIVER_SYMBOLS(SOLAR_OS_DECLARE_EXPANSION_DRIVER)
#undef SOLAR_OS_DECLARE_EXPANSION_DRIVER

#define SOLAR_OS_EXPANSION_DRIVER_POINTER(symbol) &symbol,
static const solar_os_expansion_driver_t *const expansion_drivers[] = {
    &manual_expansion_driver,
    SOLAR_OS_EXPANSION_DRIVER_SYMBOLS(SOLAR_OS_EXPANSION_DRIVER_POINTER)
};
#undef SOLAR_OS_EXPANSION_DRIVER_POINTER

typedef enum {
    EXPANSION_SLOT_ATTACHING,
    EXPANSION_SLOT_ACTIVE,
    EXPANSION_SLOT_DETACHING,
} expansion_slot_state_t;

typedef struct expansion_device_node {
    solar_os_expansion_device_t device;
    expansion_slot_state_t state;
    struct expansion_device_node *next;
} expansion_device_node_t;

static expansion_device_node_t *devices;
static SemaphoreHandle_t devices_mutex;
static StaticSemaphore_t devices_mutex_storage;

#if SOLAR_OS_BOARD_DEFAULT_EXPANSION_DEVICE_COUNT > 0
static const solar_os_expansion_default_device_t board_default_devices[] =
    SOLAR_OS_BOARD_DEFAULT_EXPANSION_DEVICES;

_Static_assert(sizeof(board_default_devices) / sizeof(board_default_devices[0]) ==
                   SOLAR_OS_BOARD_DEFAULT_EXPANSION_DEVICE_COUNT,
               "board expansion-device count does not match its definitions");
#endif

static esp_err_t expansion_attach(const char *driver,
                                  const char *name,
                                  const solar_os_expansion_binding_t *bindings,
                                  size_t binding_count,
                                  solar_os_expansion_origin_t origin,
                                  bool autostart,
                                  bool detachable);

static bool mask_contains(uint64_t mask, int pin)
{
    return pin >= 0 && pin < 64 && (mask & (1ULL << (uint32_t)pin)) != 0;
}

static bool device_name_valid(const char *name)
{
    if (name == NULL || name[0] == '\0' || strncmp(name, "bus:", 4) == 0) {
        return false;
    }
    return strnlen(name, SOLAR_OS_EXPANSION_DEVICE_NAME_MAX) < SOLAR_OS_EXPANSION_DEVICE_NAME_MAX;
}

static esp_err_t ensure_devices_mutex(void)
{
    if (devices_mutex == NULL) {
        devices_mutex = xSemaphoreCreateMutexStatic(&devices_mutex_storage);
    }
    return devices_mutex != NULL ? ESP_OK : ESP_ERR_NO_MEM;
}

static bool devices_lock_take(void)
{
    return ensure_devices_mutex() == ESP_OK &&
        xSemaphoreTake(devices_mutex, portMAX_DELAY) == pdTRUE;
}

static void devices_lock_give(void)
{
    xSemaphoreGive(devices_mutex);
}

static expansion_device_node_t *find_device_locked(const char *name)
{
    if (name == NULL) {
        return NULL;
    }
    for (expansion_device_node_t *node = devices; node != NULL; node = node->next) {
        if (strcmp(node->device.name, name) == 0) {
            return node;
        }
    }
    return NULL;
}

static void append_device_locked(expansion_device_node_t *node)
{
    expansion_device_node_t **link = &devices;
    while (*link != NULL) {
        link = &(*link)->next;
    }
    *link = node;
}

static bool remove_device_locked(expansion_device_node_t *node)
{
    expansion_device_node_t **link = &devices;
    while (*link != NULL) {
        if (*link == node) {
            *link = node->next;
            node->next = NULL;
            return true;
        }
        link = &(*link)->next;
    }
    return false;
}

static void release_device_reservation(expansion_device_node_t *node)
{
    bool removed = false;
    if (devices_lock_take()) {
        if (node->state == EXPANSION_SLOT_ATTACHING) {
            removed = remove_device_locked(node);
        }
        devices_lock_give();
    }
    if (removed) {
        solar_os_memory_free(node);
    }
}

static const solar_os_expansion_driver_t *find_driver(const char *name)
{
    if (name == NULL) {
        return NULL;
    }
    for (size_t i = 0; i < sizeof(expansion_drivers) / sizeof(expansion_drivers[0]); i++) {
        if (strcmp(expansion_drivers[i]->name, name) == 0) {
            return expansion_drivers[i];
        }
    }
    return NULL;
}

static bool binding_matches_spec(const solar_os_expansion_binding_t *binding,
                                 const solar_os_expansion_binding_spec_t *spec)
{
    if (binding == NULL || spec == NULL || binding->kind != spec->kind) {
        return false;
    }
    return spec->role == NULL || strcmp(binding->role, spec->role) == 0;
}

static const char *binding_key(const solar_os_expansion_binding_t *binding)
{
    if (binding == NULL) {
        return "resource";
    }
    switch (binding->kind) {
    case SOLAR_OS_EXPANSION_BINDING_GPIO:
    case SOLAR_OS_EXPANSION_BINDING_ADC:
    case SOLAR_OS_EXPANSION_BINDING_PWM:
        return binding->role[0] != '\0' ? binding->role :
            solar_os_expansion_binding_kind_name(binding->kind);
    case SOLAR_OS_EXPANSION_BINDING_I2S_PORT:
        return "i2s";
    case SOLAR_OS_EXPANSION_BINDING_I2C_BUS:
        return "i2c";
    case SOLAR_OS_EXPANSION_BINDING_I2C_ADDRESS:
        return "addr";
    case SOLAR_OS_EXPANSION_BINDING_SPI_BUS:
        return "spi";
    case SOLAR_OS_EXPANSION_BINDING_SPI_CS:
        return "cs";
    case SOLAR_OS_EXPANSION_BINDING_UART_PORT:
        return "uart";
    case SOLAR_OS_EXPANSION_BINDING_PS2_BUS:
        return "ps2";
    case SOLAR_OS_EXPANSION_BINDING_SCALAR_STREAM:
        return binding->role[0] != '\0' ? binding->role : "stream";
    case SOLAR_OS_EXPANSION_BINDING_PARAMETER:
        return binding->role[0] != '\0' ? binding->role : "parameter";
    default:
        return "resource";
    }
}

static void set_binding_validation(solar_os_expansion_binding_validation_t *validation,
                                   solar_os_expansion_binding_validation_reason_t reason,
                                   const char *key)
{
    if (validation == NULL) {
        return;
    }
    validation->reason = reason;
    strlcpy(validation->key, key != NULL ? key : "resource", sizeof(validation->key));
}

static bool pin_is_expansion_gpio(int pin)
{
    return solar_os_board_has(SOLAR_OS_BOARD_CAP_EXPANSION_GPIO) &&
        solar_os_pin_is_direct_gpio(pin);
}

static bool pin_is_expansion_adc(int pin)
{
    return solar_os_board_has(SOLAR_OS_BOARD_CAP_EXPANSION_ADC) &&
        mask_contains(SOLAR_OS_BOARD_EXPANSION_ADC_MASK, pin);
}

