tyh21/ESP32-S3-RLCD-4.2/solar_os/src/services/solar_os_expansion.c
typedef struct {
    solar_os_bus_protocol_t protocol;
    const char *name;
} expansion_bus_ref_t;

static bool binding_bus_ref(const solar_os_expansion_binding_t *binding,
                            expansion_bus_ref_t *ref)
{
    if (binding == NULL || ref == NULL) {
        return false;
    }
    switch (binding->kind) {
    case SOLAR_OS_EXPANSION_BINDING_I2C_BUS:
        *ref = (expansion_bus_ref_t) {
            .protocol = SOLAR_OS_BUS_PROTOCOL_I2C,
            .name = binding->target,
        };
        return true;
    case SOLAR_OS_EXPANSION_BINDING_I2C_ADDRESS:
        if (binding->target[0] == '\0') {
            return false;
        }
        *ref = (expansion_bus_ref_t) {
            .protocol = SOLAR_OS_BUS_PROTOCOL_I2C,
            .name = binding->target,
        };
        return true;
    case SOLAR_OS_EXPANSION_BINDING_SPI_BUS:
        *ref = (expansion_bus_ref_t) {
            .protocol = SOLAR_OS_BUS_PROTOCOL_SPI,
            .name = binding->target,
        };
        return true;
    case SOLAR_OS_EXPANSION_BINDING_UART_PORT:
        *ref = (expansion_bus_ref_t) {
            .protocol = SOLAR_OS_BUS_PROTOCOL_UART,
            .name = binding->target,
        };
        return true;
    case SOLAR_OS_EXPANSION_BINDING_PS2_BUS:
        *ref = (expansion_bus_ref_t) {
            .protocol = SOLAR_OS_BUS_PROTOCOL_PS2,
            .name = binding->target,
        };
        return true;
    default:
        return false;
    }
}

static esp_err_t acquire_binding_buses(const solar_os_expansion_binding_t *bindings,
                                       size_t binding_count,
                                       const char *owner)
{
    expansion_bus_ref_t acquired[SOLAR_OS_EXPANSION_DEVICE_BINDING_MAX];
    size_t acquired_count = 0;

    for (size_t i = 0; i < binding_count; i++) {
        expansion_bus_ref_t ref;
        if (!binding_bus_ref(&bindings[i], &ref)) {
            continue;
        }
        bool duplicate = false;
        for (size_t j = 0; j < acquired_count; j++) {
            if (acquired[j].protocol == ref.protocol &&
                strcmp(acquired[j].name, ref.name) == 0) {
                duplicate = true;
                break;
            }
        }
        if (duplicate) {
            continue;
        }

        const esp_err_t ret = solar_os_bus_acquire(ref.name, ref.protocol, owner);
        if (ret != ESP_OK) {
            (void)solar_os_bus_release_owner(owner);
            return ret;
        }
        acquired[acquired_count++] = ref;
    }
    return ESP_OK;
}

static bool expansion_device_exists(const char *name)
{
    if (!devices_lock_take()) {
        return false;
    }
    const bool exists = find_device_locked(name) != NULL;
    devices_lock_give();
    return exists;
}

static esp_err_t expansion_init_board_defaults(bool early)
{
    ESP_RETURN_ON_ERROR(ensure_devices_mutex(), "expansion", "device registry init failed");
    ESP_RETURN_ON_ERROR(solar_os_resources_init(), "expansion", "resource init failed");
    ESP_RETURN_ON_ERROR(solar_os_buses_init(), "expansion", "bus init failed");
    esp_err_t first_error = ESP_OK;
#if SOLAR_OS_BOARD_DEFAULT_EXPANSION_DEVICE_COUNT > 0
    for (size_t i = 0; i < SOLAR_OS_BOARD_DEFAULT_EXPANSION_DEVICE_COUNT; i++) {
        const solar_os_expansion_default_device_t *device = &board_default_devices[i];
        const solar_os_expansion_driver_t *driver = find_driver(device->driver);
        if (driver == NULL || driver->early != early || expansion_device_exists(device->name)) {
            continue;
        }
        const esp_err_t err = expansion_attach(device->driver,
                                               device->name,
                                               device->bindings,
                                               device->binding_count,
                                               SOLAR_OS_EXPANSION_ORIGIN_BOARD,
                                               true,
                                               false);
        if (err != ESP_OK) {
            ESP_LOGW("expansion",
                     "Board device %s (%s) unavailable: %s",
                     device->name,
                     device->driver,
                     esp_err_to_name(err));
            if (first_error == ESP_OK) {
                first_error = err;
            }
        }
    }
#endif
    return first_error;
}

esp_err_t solar_os_expansion_init_early(void)
{
    return expansion_init_board_defaults(true);
}

esp_err_t solar_os_expansion_init(void)
{
    return expansion_init_board_defaults(false);
}

bool solar_os_expansion_available(void)
{
    return solar_os_board_has(SOLAR_OS_BOARD_CAP_EXPANSION_GPIO) ||
        solar_os_bus_count_protocol(SOLAR_OS_BUS_PROTOCOL_I2C) > 0 ||
        solar_os_bus_count_protocol(SOLAR_OS_BUS_PROTOCOL_SPI) > 0 ||
        solar_os_bus_count_protocol(SOLAR_OS_BUS_PROTOCOL_UART) > 0 ||
        solar_os_bus_count_protocol(SOLAR_OS_BUS_PROTOCOL_MIDI) > 0 ||
        solar_os_bus_count_protocol(SOLAR_OS_BUS_PROTOCOL_ONEWIRE) > 0 ||
        solar_os_bus_count_protocol(SOLAR_OS_BUS_PROTOCOL_PS2) > 0 ||
        solar_os_board_has(SOLAR_OS_BOARD_CAP_EXPANSION_ADC) ||
        solar_os_board_has(SOLAR_OS_BOARD_CAP_EXPANSION_PWM) ||
        solar_os_board_has(SOLAR_OS_BOARD_CAP_EXPANSION_I2S);
}

size_t solar_os_expansion_driver_count(void)
{
    return sizeof(expansion_drivers) / sizeof(expansion_drivers[0]);
}

bool solar_os_expansion_get_driver(size_t index, solar_os_expansion_driver_t *driver)
{
    if (driver == NULL || index >= solar_os_expansion_driver_count()) {
        return false;
    }
    *driver = *expansion_drivers[index];
    return true;
}

const char *solar_os_expansion_category_name(solar_os_expansion_category_t category)
{
    static const char *const names[SOLAR_OS_EXPANSION_CATEGORY_COUNT] = {
        [SOLAR_OS_EXPANSION_CATEGORY_AUDIO] = "Audio",
        [SOLAR_OS_EXPANSION_CATEGORY_DISPLAY] = "Display",
        [SOLAR_OS_EXPANSION_CATEGORY_INPUT] = "Input",
        [SOLAR_OS_EXPANSION_CATEGORY_POWER] = "Power",
        [SOLAR_OS_EXPANSION_CATEGORY_RADIO] = "Radio",
        [SOLAR_OS_EXPANSION_CATEGORY_SENSOR] = "Sensor",
        [SOLAR_OS_EXPANSION_CATEGORY_STORAGE] = "Storage",
        [SOLAR_OS_EXPANSION_CATEGORY_UTILITY] = "Utility",
    };
    return (unsigned)category < SOLAR_OS_EXPANSION_CATEGORY_COUNT ?
        names[category] : "Utility";
}

