tyh21/ESP32-S3-RLCD-4.2/solar_os/src/services/solar_os_expansion.c
bool solar_os_expansion_driver_supported(const char *name)
{
    const solar_os_expansion_driver_t *driver = find_driver(name);
    if (driver == NULL) {
        return false;
    }
    solar_os_board_capabilities_t caps = solar_os_board_capabilities();
    if (solar_os_bus_count_protocol(SOLAR_OS_BUS_PROTOCOL_I2C) > 0) {
        caps |= SOLAR_OS_BOARD_CAP_EXPANSION_I2C;
    }
    if (solar_os_bus_count_protocol(SOLAR_OS_BUS_PROTOCOL_SPI) > 0) {
        caps |= SOLAR_OS_BOARD_CAP_EXPANSION_SPI;
    }
    if (solar_os_bus_count_protocol(SOLAR_OS_BUS_PROTOCOL_UART) > 0 ||
        solar_os_bus_count_protocol(SOLAR_OS_BUS_PROTOCOL_MIDI) > 0) {
        caps |= SOLAR_OS_BOARD_CAP_EXPANSION_UART;
    }
    return driver->required_capabilities == 0 ||
        (caps & driver->required_capabilities) == driver->required_capabilities;
}

static esp_err_t validate_bindings(
    const char *driver,
    const solar_os_expansion_binding_t *bindings,
    size_t binding_count,
    solar_os_expansion_binding_validation_t *validation,
    bool allow_board_pins)
{
    if (validation != NULL) {
        memset(validation, 0, sizeof(*validation));
        validation->reason = SOLAR_OS_EXPANSION_BINDINGS_VALID;
    }
    if (driver == NULL || driver[0] == '\0' ||
        binding_count > SOLAR_OS_EXPANSION_DEVICE_BINDING_MAX ||
        (binding_count > 0 && bindings == NULL)) {
        return ESP_ERR_INVALID_ARG;
    }

    const solar_os_expansion_driver_t *driver_def = find_driver(driver);
    if (driver_def == NULL) {
        return ESP_ERR_NOT_FOUND;
    }
    if (driver_def->allow_unlisted_bindings && binding_count == 0) {
        set_binding_validation(validation, SOLAR_OS_EXPANSION_BINDINGS_MISSING, "resource");
        return ESP_ERR_INVALID_ARG;
    }

    for (size_t i = 0; i < binding_count; i++) {
        const solar_os_expansion_binding_spec_t *matched = NULL;
        size_t matches = 0;
        for (size_t s = 0; s < driver_def->binding_spec_count; s++) {
            const solar_os_expansion_binding_spec_t *spec = &driver_def->binding_specs[s];
            if (!binding_matches_spec(&bindings[i], spec)) {
                continue;
            }
            matched = spec;
            for (size_t j = 0; j < i; j++) {
                if (binding_matches_spec(&bindings[j], spec)) {
                    matches++;
                }
            }
            break;
        }
        if (matched == NULL &&
            (!driver_def->allow_unlisted_bindings ||
             bindings[i].kind == SOLAR_OS_EXPANSION_BINDING_PARAMETER)) {
            set_binding_validation(validation,
                                   SOLAR_OS_EXPANSION_BINDINGS_UNEXPECTED,
                                   binding_key(&bindings[i]));
            return ESP_ERR_INVALID_ARG;
        }
        if (matched != NULL && matches > 0) {
            set_binding_validation(validation,
                                   SOLAR_OS_EXPANSION_BINDINGS_DUPLICATE,
                                   matched->key);
            return ESP_ERR_INVALID_ARG;
        }
        if (matched != NULL && matched->allowed_value_count > 0) {
            bool allowed = false;
            for (size_t v = 0; v < matched->allowed_value_count; v++) {
                if (bindings[i].value == matched->allowed_values[v]) {
                    allowed = true;
                    break;
                }
            }
            if (!allowed) {
                set_binding_validation(validation,
                                       SOLAR_OS_EXPANSION_BINDINGS_INVALID_VALUE,
                                       matched->key);
                return ESP_ERR_INVALID_ARG;
            }
        }
        if (matched != NULL && matched->has_value_range &&
            (bindings[i].value < matched->min_value ||
             bindings[i].value > matched->max_value)) {
            set_binding_validation(validation,
                                   SOLAR_OS_EXPANSION_BINDINGS_INVALID_VALUE,
                                   matched->key);
            return ESP_ERR_INVALID_ARG;
        }
    }

    for (size_t s = 0; s < driver_def->binding_spec_count; s++) {
        const solar_os_expansion_binding_spec_t *spec = &driver_def->binding_specs[s];
        if (!spec->required) {
            continue;
        }
        bool found = false;
        for (size_t i = 0; i < binding_count; i++) {
            if (binding_matches_spec(&bindings[i], spec)) {
                found = true;
                break;
            }
        }
        if (!found) {
            set_binding_validation(validation,
                                   SOLAR_OS_EXPANSION_BINDINGS_MISSING,
                                   spec->key);
            return ESP_ERR_INVALID_ARG;
        }
    }

    for (size_t i = 0; i < binding_count; i++) {
        if (!binding_valid(&bindings[i],
                           bindings,
                           binding_count,
                           allow_board_pins)) {
            set_binding_validation(validation,
                                   SOLAR_OS_EXPANSION_BINDINGS_UNAVAILABLE,
                                   binding_key(&bindings[i]));
            return ESP_ERR_INVALID_ARG;
        }
    }
    return ESP_OK;
}

esp_err_t solar_os_expansion_validate_bindings(
    const char *driver,
    const solar_os_expansion_binding_t *bindings,
    size_t binding_count,
    solar_os_expansion_binding_validation_t *validation)
{
    return validate_bindings(driver,
                             bindings,
                             binding_count,
                             validation,
                             false);
}

size_t solar_os_expansion_i2c_bus_count(void)
{
    return solar_os_bus_count_protocol(SOLAR_OS_BUS_PROTOCOL_I2C);
}

bool solar_os_expansion_get_i2c_bus(size_t index, solar_os_expansion_i2c_bus_t *bus)
{
    if (bus == NULL) {
        return false;
    }
    solar_os_bus_info_t info;
    if (!solar_os_bus_get_protocol(SOLAR_OS_BUS_PROTOCOL_I2C, index, &info)) {
        return false;
    }
    *bus = (solar_os_expansion_i2c_bus_t) {
        .port = info.config.i2c.port,
        .sda_pin = info.config.i2c.sda_pin,
        .scl_pin = info.config.i2c.scl_pin,
        .speed_hz = info.config.i2c.speed_hz,
    };
    strlcpy(bus->name, info.name, sizeof(bus->name));
    return true;
}

bool solar_os_expansion_find_i2c_bus(const char *name, solar_os_expansion_i2c_bus_t *bus, size_t *index)
{
    solar_os_bus_info_t info;
    if (!solar_os_bus_find(name, SOLAR_OS_BUS_PROTOCOL_I2C, &info)) {
        return false;
    }
    if (bus != NULL) {
        *bus = (solar_os_expansion_i2c_bus_t) {
            .port = info.config.i2c.port,
            .sda_pin = info.config.i2c.sda_pin,
            .scl_pin = info.config.i2c.scl_pin,
            .speed_hz = info.config.i2c.speed_hz,
        };
        strlcpy(bus->name, info.name, sizeof(bus->name));
    }
    if (index != NULL) {
        *index = info.id;
    }
    return true;
}

size_t solar_os_expansion_spi_bus_count(void)
{
    return solar_os_bus_count_protocol(SOLAR_OS_BUS_PROTOCOL_SPI);
}

bool solar_os_expansion_get_spi_bus(size_t index, solar_os_expansion_spi_bus_t *bus)
{
    if (bus == NULL) {
        return false;
    }
    solar_os_bus_info_t info;
    if (!solar_os_bus_get_protocol(SOLAR_OS_BUS_PROTOCOL_SPI, index, &info)) {
        return false;
    }
    *bus = (solar_os_expansion_spi_bus_t) {
        .host = info.config.spi.host,
        .sclk_pin = info.config.spi.sclk_pin,
        .miso_pin = info.config.spi.miso_pin,
        .mosi_pin = info.config.spi.mosi_pin,
        .max_transfer_size = info.config.spi.max_transfer_size,
        .cs_count = info.config.spi.cs_count,
    };
    strlcpy(bus->name, info.name, sizeof(bus->name));
    for (size_t i = 0; i < info.config.spi.cs_count && i < SOLAR_OS_EXPANSION_SPI_CS_MAX; i++) {
        bus->cs[i] = info.config.spi.cs[i];
    }
    return true;
}

bool solar_os_expansion_find_spi_bus(const char *name, solar_os_expansion_spi_bus_t *bus, size_t *index)
{
    solar_os_bus_info_t info;
    if (!solar_os_bus_find(name, SOLAR_OS_BUS_PROTOCOL_SPI, &info)) {
        return false;
    }
    if (bus != NULL) {
        *bus = (solar_os_expansion_spi_bus_t) {
            .host = info.config.spi.host,
            .sclk_pin = info.config.spi.sclk_pin,
            .miso_pin = info.config.spi.miso_pin,
            .mosi_pin = info.config.spi.mosi_pin,
            .max_transfer_size = info.config.spi.max_transfer_size,
            .cs_count = info.config.spi.cs_count,
        };
        strlcpy(bus->name, info.name, sizeof(bus->name));
        for (size_t i = 0; i < info.config.spi.cs_count && i < SOLAR_OS_EXPANSION_SPI_CS_MAX; i++) {
            bus->cs[i] = info.config.spi.cs[i];
        }
    }
    if (index != NULL) {
        *index = info.id;
    }
    return true;
}

bool solar_os_expansion_spi_cs_allowed(const char *bus_name, int pin)
{
    for (size_t i = 0; i < solar_os_bus_count_protocol(SOLAR_OS_BUS_PROTOCOL_SPI); i++) {
        solar_os_bus_info_t bus;
        if (!solar_os_bus_get_protocol(SOLAR_OS_BUS_PROTOCOL_SPI, i, &bus) ||
            (bus_name != NULL && strcmp(bus.name, bus_name) != 0)) {
            continue;
        }
        for (size_t cs = 0;
             cs < bus.config.spi.cs_count && cs < SOLAR_OS_EXPANSION_SPI_CS_MAX;
             cs++) {
            if (bus.config.spi.cs[cs].pin == pin) {
                return true;
            }
        }
    }
    return false;
}

size_t solar_os_expansion_uart_port_count(void)
{
    return solar_os_bus_count_protocol(SOLAR_OS_BUS_PROTOCOL_UART);
}

bool solar_os_expansion_get_uart_port(size_t index, solar_os_expansion_uart_port_t *port)
{
    if (port == NULL) {
        return false;
    }
    solar_os_bus_info_t info;
    if (!solar_os_bus_get_protocol(SOLAR_OS_BUS_PROTOCOL_UART, index, &info)) {
        return false;
    }
    *port = (solar_os_expansion_uart_port_t) {
        .port = info.config.uart.port,
        .tx_pin = info.config.uart.tx_pin,
        .rx_pin = info.config.uart.rx_pin,
        .baud_rate = info.config.uart.baud_rate,
    };
    strlcpy(port->name, info.name, sizeof(port->name));
    return true;
}

bool solar_os_expansion_find_uart_port(const char *name, solar_os_expansion_uart_port_t *port, size_t *index)
{
    solar_os_bus_info_t info;
    if (!solar_os_bus_find(name, SOLAR_OS_BUS_PROTOCOL_UART, &info)) {
        return false;
    }
    if (port != NULL) {
        *port = (solar_os_expansion_uart_port_t) {
            .port = info.config.uart.port,
            .tx_pin = info.config.uart.tx_pin,
            .rx_pin = info.config.uart.rx_pin,
            .baud_rate = info.config.uart.baud_rate,
        };
        strlcpy(port->name, info.name, sizeof(port->name));
    }
    if (index != NULL) {
        *index = info.id;
    }
    return true;
}

size_t solar_os_expansion_onewire_bus_count(void)
{
    return solar_os_bus_count_protocol(SOLAR_OS_BUS_PROTOCOL_ONEWIRE);
}

bool solar_os_expansion_get_onewire_bus(size_t index, solar_os_expansion_onewire_bus_t *bus)
{
    if (bus == NULL) {
        return false;
    }
    solar_os_bus_info_t info;
    if (!solar_os_bus_get_protocol(SOLAR_OS_BUS_PROTOCOL_ONEWIRE, index, &info)) {
        return false;
    }
    *bus = (solar_os_expansion_onewire_bus_t) {
        .pin = info.config.onewire.pin,
    };
    strlcpy(bus->name, info.name, sizeof(bus->name));
    return true;
}

bool solar_os_expansion_find_onewire_bus(const char *name,
                                         solar_os_expansion_onewire_bus_t *bus,
                                         size_t *index)
{
    solar_os_bus_info_t info;
    if (!solar_os_bus_find(name, SOLAR_OS_BUS_PROTOCOL_ONEWIRE, &info)) {
        return false;
    }
    if (bus != NULL) {
        *bus = (solar_os_expansion_onewire_bus_t) {
            .pin = info.config.onewire.pin,
        };
        strlcpy(bus->name, info.name, sizeof(bus->name));
    }
    if (index != NULL) {
        *index = info.id;
    }
    return true;
}

static esp_err_t expansion_attach(const char *driver,
                                  const char *name,
                                  const solar_os_expansion_binding_t *bindings,
                                  size_t binding_count,
                                  solar_os_expansion_origin_t origin,
                                  bool autostart,
                                  bool detachable)
{
    if (driver == NULL || driver[0] == '\0' ||
        !device_name_valid(name) ||
        binding_count > SOLAR_OS_EXPANSION_DEVICE_BINDING_MAX ||
        (binding_count > 0 && bindings == NULL)) {
        return ESP_ERR_INVALID_ARG;
    }
    if (!solar_os_expansion_available()) {
        return ESP_ERR_NOT_SUPPORTED;
    }
    const solar_os_expansion_driver_t *driver_def = find_driver(driver);
    if (driver_def == NULL || !solar_os_expansion_driver_supported(driver)) {
        return ESP_ERR_NOT_FOUND;
    }
    ESP_RETURN_ON_ERROR(validate_bindings(driver,
                                          bindings,
                                          binding_count,
                                          NULL,
                                          origin == SOLAR_OS_EXPANSION_ORIGIN_BOARD),
                        "expansion",
                        "invalid bindings");
    solar_os_expansion_binding_t normalized[SOLAR_OS_EXPANSION_DEVICE_BINDING_MAX];
    for (size_t i = 0; i < binding_count; i++) {
        normalized[i] = bindings[i];
    }
    solar_os_resource_request_t requests[SOLAR_OS_RESOURCE_BUNDLE_MAX];
    size_t request_count = 0;
    for (size_t i = 0; i < binding_count; i++) {
        const esp_err_t ret = append_binding_claims(&normalized[i],
                                                    normalized,
                                                    binding_count,
                                                    requests,
                                                    &request_count);
        if (ret != ESP_OK) {
            return ret;
        }
    }

    expansion_device_node_t *node = solar_os_memory_calloc(
        1,
        sizeof(*node),
        SOLAR_OS_MEMORY_EXTERNAL_PREFERRED,
        "expansion.device");
    if (node == NULL) {
        return ESP_ERR_NO_MEM;
    }
    strlcpy(node->device.name, name, sizeof(node->device.name));
    strlcpy(node->device.driver, driver, sizeof(node->device.driver));
    node->device.origin = origin;
    node->device.autostart = autostart;
    node->device.detachable = detachable;
    node->device.binding_count = binding_count;
    memcpy(node->device.bindings,
           normalized,
           binding_count * sizeof(normalized[0]));
    node->state = EXPANSION_SLOT_ATTACHING;

