tyh21/ESP32-S3-RLCD-4.2/solar_os/src/services/solar_os_expansion.c
    if (!devices_lock_take()) {
        solar_os_memory_free(node);
        return ESP_ERR_NO_MEM;
    }
    if (find_device_locked(name) != NULL) {
        devices_lock_give();
        solar_os_memory_free(node);
        return ESP_ERR_INVALID_STATE;
    }
    append_device_locked(node);
    devices_lock_give();

    if (request_count > 0) {
        const esp_err_t ret = solar_os_resource_claim_bundle(requests,
                                                             request_count,
                                                             name,
                                                             NULL);
        if (ret != ESP_OK) {
            release_device_reservation(node);
            return ret;
        }
    }

    const esp_err_t bus_ret = acquire_binding_buses(normalized, binding_count, name);
    if (bus_ret != ESP_OK) {
        (void)solar_os_resource_release_owner(name);
        release_device_reservation(node);
        return bus_ret;
    }

    if (driver_def->attach != NULL) {
        const esp_err_t ret = driver_def->attach(name, normalized, binding_count);
        if (ret != ESP_OK) {
            (void)solar_os_bus_release_owner(name);
            (void)solar_os_resource_release_owner(name);
            release_device_reservation(node);
            return ret;
        }
    }

    if (!devices_lock_take()) {
        (void)solar_os_bus_release_owner(name);
        (void)solar_os_resource_release_owner(name);
        release_device_reservation(node);
        return ESP_ERR_NO_MEM;
    }
    if (node->state != EXPANSION_SLOT_ATTACHING) {
        devices_lock_give();
        (void)solar_os_bus_release_owner(name);
        (void)solar_os_resource_release_owner(name);
        return ESP_ERR_INVALID_STATE;
    }
    node->device.active = true;
    node->device.ready = true;
    node->state = EXPANSION_SLOT_ACTIVE;
    devices_lock_give();
    return ESP_OK;
}

esp_err_t solar_os_expansion_attach(const char *driver,
                                    const char *name,
                                    const solar_os_expansion_binding_t *bindings,
                                    size_t binding_count)
{
    return expansion_attach(driver,
                            name,
                            bindings,
                            binding_count,
                            SOLAR_OS_EXPANSION_ORIGIN_RUNTIME,
                            false,
                            true);
}

esp_err_t solar_os_expansion_detach(const char *name)
{
    solar_os_expansion_device_t device;
    expansion_device_node_t *node = NULL;

    if (!devices_lock_take()) {
        return ESP_ERR_NO_MEM;
    }
    node = find_device_locked(name);
    if (node == NULL) {
        devices_lock_give();
        return ESP_ERR_NOT_FOUND;
    }
    if (node->state != EXPANSION_SLOT_ACTIVE) {
        devices_lock_give();
        return ESP_ERR_INVALID_STATE;
    }
    if (!node->device.detachable) {
        devices_lock_give();
        return ESP_ERR_NOT_SUPPORTED;
    }
    device = node->device;
    node->device.active = false;
    node->state = EXPANSION_SLOT_DETACHING;
    devices_lock_give();

    const solar_os_expansion_driver_t *driver = find_driver(device.driver);
    if (driver != NULL && driver->detach != NULL) {
        const esp_err_t ret = driver->detach(name);
        if (ret != ESP_OK) {
            if (devices_lock_take()) {
                if (node->state == EXPANSION_SLOT_DETACHING) {
                    node->device.active = true;
                    node->state = EXPANSION_SLOT_ACTIVE;
                }
                devices_lock_give();
            }
            return ret;
        }
    }

    (void)solar_os_bus_release_owner(name);
    (void)solar_os_resource_release_owner(name);
    bool removed = false;
    if (devices_lock_take()) {
        if (node->state == EXPANSION_SLOT_DETACHING) {
            removed = remove_device_locked(node);
        }
        devices_lock_give();
    }
    if (removed) {
        solar_os_memory_free(node);
    }
    return removed ? ESP_OK : ESP_ERR_INVALID_STATE;
}

esp_err_t solar_os_expansion_device_set_ready(const char *name, bool ready)
{
    if (!device_name_valid(name)) {
        return ESP_ERR_INVALID_ARG;
    }

    esp_err_t result = ESP_OK;
    if (!devices_lock_take()) {
        return ESP_ERR_NO_MEM;
    }
    expansion_device_node_t *node = find_device_locked(name);
    if (node == NULL) {
        result = ESP_ERR_NOT_FOUND;
    } else if (node->state != EXPANSION_SLOT_ACTIVE) {
        result = ESP_ERR_INVALID_STATE;
    } else {
        node->device.ready = ready;
    }
    devices_lock_give();
    return result;
}

size_t solar_os_expansion_device_count(void)
{
    size_t count = 0;
    if (!devices_lock_take()) {
        return 0;
    }
    for (expansion_device_node_t *node = devices; node != NULL; node = node->next) {
        if (node->state == EXPANSION_SLOT_ACTIVE) {
            count++;
        }
    }
    devices_lock_give();
    return count;
}

bool solar_os_expansion_get_device(size_t index, solar_os_expansion_device_t *device)
{
    size_t current = 0;
    if (device == NULL) {
        return false;
    }
    if (!devices_lock_take()) {
        return false;
    }
    for (expansion_device_node_t *node = devices; node != NULL; node = node->next) {
        if (node->state != EXPANSION_SLOT_ACTIVE) {
            continue;
        }
        if (current++ == index) {
            *device = node->device;
            devices_lock_give();
            return true;
        }
    }
    devices_lock_give();
    return false;
}

const char *solar_os_expansion_binding_kind_name(solar_os_expansion_binding_kind_t kind)
{
    switch (kind) {
    case SOLAR_OS_EXPANSION_BINDING_GPIO:
        return "gpio";
    case SOLAR_OS_EXPANSION_BINDING_ADC:
        return "adc";
    case SOLAR_OS_EXPANSION_BINDING_PWM:
        return "pwm";
    case SOLAR_OS_EXPANSION_BINDING_I2S_PORT:
        return "i2s";
    case SOLAR_OS_EXPANSION_BINDING_I2C_BUS:
        return "i2c";
    case SOLAR_OS_EXPANSION_BINDING_I2C_ADDRESS:
        return "i2c_addr";
    case SOLAR_OS_EXPANSION_BINDING_SPI_BUS:
        return "spi";
    case SOLAR_OS_EXPANSION_BINDING_SPI_CS:
        return "spi_cs";
    case SOLAR_OS_EXPANSION_BINDING_UART_PORT:
        return "uart";
    case SOLAR_OS_EXPANSION_BINDING_PS2_BUS:
        return "ps2";
    case SOLAR_OS_EXPANSION_BINDING_SCALAR_STREAM:
        return "scalar";
    case SOLAR_OS_EXPANSION_BINDING_PARAMETER:
        return "parameter";
    default:
        return "unknown";
    }
}

const char *solar_os_expansion_origin_name(solar_os_expansion_origin_t origin)
{
    return origin == SOLAR_OS_EXPANSION_ORIGIN_RUNTIME ? "runtime" : "board";
}
